storage/Fluid_Data/rans/ConvDivChannel/Re7900_kOmega_100_ml/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];


internalField   nonuniform List<vector> 
14000
(
(0.0894797501290148 4.43336792874575e-05 0)
(0.0873742826456688 7.59830228896984e-05 0)
(0.0834856100822036 6.8313341682118e-05 0)
(0.0788098114758689 6.94560817768553e-05 0)
(0.0733881930803442 0.000139661461791177 0)
(0.0682763364448152 0.000346170692779464 0)
(0.0643578022796512 0.000693832917245434 -2.6686354609167e-19)
(0.0616344595655314 0.00117164107392418 0)
...
)
;

boundaryField
{
    bottomWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    topWall
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<vector> 
100
(
(0.063132409 -0.000000000 0.000000000)
(0.190936780 -0.000000000 0.000000000)
(0.315378859 -0.000000000 0.000000000)
(0.416254130 -0.000000000 0.000000000)
(0.488717077 -0.000000000 0.000000000)
(0.541906393 -0.000000000 0.000000000)
(0.583197255 -0.000000000 0.000000000)
(0.616796734 -0.000000000 0.000000000)
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
