storage/Fluid_Data/rans/ConvDivChannel/Re7900_kOmega_100_ml/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];


internalField   nonuniform List<scalar> 
14000
(
583.984805300185
583.967107067374
583.936441179739
583.901163318955
583.894851889158
584.051667984148
584.584123981373
585.722320650001
...
)
;

boundaryField
{
    bottomWall
    {
        blending        binomial2;
        n               2;
        beta1           0.075;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
140
(
583.984805300185
583.967107067374
583.936441179739
583.901163318955
583.894851889158
584.051667984148
584.584123981373
585.722320650001
...
)
;
    }
    topWall
    {
        blending        binomial2;
        n               2;
        beta1           0.075;
        type            omegaWallFunction;
        value           nonuniform List<scalar> 
140
(
2012.80328473323
2012.80664169225
2012.81131788604
2012.81680816506
2012.82318549387
2012.83040114982
2012.83848238749
2012.84749532825
...
)
;
    }
    inlet
    {
        type            fixedValue;
        value           nonuniform List<scalar> 
100
(
930.861255861
165.887890725
65.233860854
37.586153149
25.014925458
18.031855015
13.741605681
10.904252939
...
)
;
    }
    outlet
    {
        type            zeroGradient;
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
