storage/Fluid_Data/rans/ConvDivChannel/Re7900_kOmega_100_ml/0/phi
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phi;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];
oriented        oriented;


internalField   nonuniform List<scalar> 
27760
(
0.000117000109100286
1.65824743995159e-06
0.000112650623347999
4.34948575228753e-06
0.000107077409557016
5.57321379098253e-06
0.000100431930658234
6.6454788987805e-06
...
)
;

boundaryField
{
    bottomWall
    {
        type            calculated;
        value           uniform 0;
    }
    topWall
    {
        type            calculated;
        value           uniform 0;
    }
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
-0.00011865835654024
-0.000368491826094019
-0.000586769562774494
-0.000747891606479864
-0.000876705464802509
-0.000990532184273508
-0.00109742577524578
-0.00120156648925163
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
100
(
0.000125065762817984
0.000386786999104702
0.000607894491477224
0.000765579056646759
0.000888610483638985
0.000995024150078978
0.00109327947797342
0.00118789684386043
...
)
;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform List<scalar> 0();
    }
}


// ************************************************************************* //
