storage/Fluid_Data/rans/ConvDivChannel/Re7900_kOmega_100_ml/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType RAS;

RAS
{

    RASModel        kOmegaMl;

    turbulence      on;

    printCoeffs     on;
    
    gamma_start     0.0;
    gamma_max       0.8;
    end_ramp	    0.5;
    model_k	    true;
    model_omega     true;

}

// ************************************************************************* //
